Revit 2022 API
IndependentTag.HasElbow Property
 Whether the tag's leader has an elbow point or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `HasLeaderElbow(Reference)` method instead.")]
public bool HasElbow { get; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `HasLeaderElbow(Reference)` method instead.")> _
Public ReadOnly Property HasElbow As Boolean
	Get
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `HasLeaderElbow(Reference)` method instead.")]
public:
property bool HasElbow {
	bool get ();
}
Remarks
 Straight leaders do not have elbow points. LeaderElbow.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The tag does not have a leader.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace